<a href="https://colab.research.google.com/github/Miladatasys/sic_ai/blob/main/Checking_for_Missing_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
import numpy as pn

Missing Value

In [4]:
import seaborn as sns

df = sns.load_dataset('titanic')
nan_deck = df['deck'].value_counts(dropna = False)
print(nan_deck)

#sns es la librería que en este caso, nos carga el dataset automáticamente
#acá vemos la información por deck o piso del titanic y añadimos al df los valores nulos ya que por defecto value_counts no los cuenta

deck
NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: count, dtype: int64

In [5]:
print(df.head().isnull())
print(df.head().notnull())

# head() retorna las primeras 5 filas por defecto, para inspeccionar rápidamente la data
# isnull() hace que cada entrada sea de valor booleano, True indica que el valor está perdido (es NaN) y False indica que no lo está
# notnull() hace lo mismo pero retornando True para los valores que sí están presentes y False para los que están perdidos

   survived  pclass    sex    age  sibsp  parch   fare  embarked  class  \
0     False   False  False  False  False  False  False     False  False
1     False   False  False  False  False  False  False     False  False
2     False   False  False  False  False  False  False     False  False
3     False   False  False  False  False  False  False     False  False
4     False   False  False  False  False  False  False     False  False

     who  adult_male   deck  embark_town  alive  alone
0  False       False   True        False  False  False
1  False       False  False        False  False  False
2  False       False   True        False  False  False
3  False       False  False        False  False  False
4  False       False   True        False  False  False
   survived  pclass   sex   age  sibsp  parch  fare  embarked  class   who  \
0      True    True  True  True   True   True  True      True   True  True
1      True    True  True  True   True   True  True      True   True  True
2      True    True  True  True   True   True  True      True   True  True
3      True    True  True  True   True   True  True      True   True  True
4      True    True  True  True   True   True  True      True   True  True

   adult_male   deck  embark_town  alive  alone
0        True  False         True   True   True
1        True   True         True   True   True
2        True  False         True   True   True
3        True   True         True   True   True
4        True  False         True   True   True

In [6]:
print(df.head().isnull().sum(axis=0))

# Retornamos las primeras 5 filas del DataFrame
# Comprobamos si existen datos nulos
# sum(axis=0) suma los valores booleanos (True como 1 y False como 0) en cada columna para contar los valores nulos

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           3
embark_town    0
alive          0
alone          0
dtype: int64

In [7]:
df_thresh = df.dropna(axis = 1, thresh = 500)
print(df_thresh.columns)
print(df_thresh.shape)

#dropna(axis= 1, tresh=500) elimina las columnas que tienen menos de 500 valores nulos
#axis = 1 indica que la operación se realizará en columnas, ya que el axis = 0 es para filas

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')
(891, 14)

In [9]:
df_age = df.dropna(subset= ['age'])
mean_age = df['age'].mean(axis = 0)
df['age'].fillna(mean_age, inplace = True)
print(df['age'].head(10))

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64